Pepeuch/mowglinext/firmware/stm32/ros_usbnode/src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  Georg Swoboda <cn@warp.at>
 * @date    21/09/2022
 * @version 1.0.0
 * @brief   main / bootup and initialization, motor control routines, usb init
 ******************************************************************************
 *
 * compile with -DBOARD_YARDFORCE500 to enable the YF500 GForce pinout
 *
 * ROS integration howto taken from here: https://github.com/Itamare4/ROS_stm32f1_rosserial_USB_VCP (Itamar Eliakim)
 *
 ******************************************************************************
 */

#include <stdio.h>
#include <stdbool.h>
#include <stdarg.h>
#include <math.h>
#include <string.h>
#include "stm32f_board_hal.h"
#include "hal/hal_gpio.h"
#include "hal/hal_time.h"
#include "hal/hal_uart.h"
#include "hal/hal_pwm.h"
#include "board_config.h"
#include "main.h"
// stm32 custom
#include "board_config.h"
#include "board.h"
#include "panel.h"
#include "panel.h"
#include "blademotor.h"
#include "drivemotor.h"
#include "emergency.h"
#include "blademotor.h"
#include "drivemotor.h"
#include "ultrasonic_sensor.h"
#include "perimeter.h"
#include "adc.h"
#include "charger.h"
#include "soft_i2c.h"
#include "i2c.h"
#include "imu/imu.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "nbt.h"

// ros
#include "cpp_main.h"
#include "ringbuffer.h"

static void WATCHDOG_vInit(void);
static void WATCHDOG_Refresh(void);
void TIM4_Init(void);
void HALLSTOP_Sensor_Init(void);

static nbt_t main_chargecontroller_nbt;
static nbt_t main_statusled_nbt;
static nbt_t main_emergency_nbt;
static nbt_t main_blademotor_nbt;
static nbt_t main_drivemotor_nbt;
static nbt_t main_wdg_nbt;
static nbt_t main_buzzer_nbt;
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
static nbt_t main_ultrasonicsensor_nbt;
#endif
#if BOARD_HAS_MASTER_USART
volatile uint8_t master_tx_busy = 0;
static uint8_t master_tx_buffer_len;
static char master_tx_buffer[255];
#endif

uint8_t do_chirp_duration_counter;
uint8_t do_chirp = 0;

openmower_status_e main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;

#if BOARD_HAS_MASTER_USART
UART_HandleTypeDef MASTER_USART_Handler; // UART Handle
static hal_uart_t MASTER_UART = { &MASTER_USART_Handler };
#endif

// Drive Motors DMA
DMA_HandleTypeDef hdma_uart4_rx;
DMA_HandleTypeDef hdma_uart4_tx;
TIM_HandleTypeDef TIM3_Handle; // PWM Beeper
TIM_HandleTypeDef TIM4_Handle; // PWM Buzzer
IWDG_HandleTypeDef IwdgHandle = {0};
WWDG_HandleTypeDef WwdgHandle = {0};

#if DB_ACTIVE
int debug_assert(int condition, const char *msg)
{
  if (condition)
  {
    return 0;
  }
  debug_printf(msg);
  return 1;
}
#endif

int main(void)
{

  HAL_Init();
  SystemClock_Config();

#if BOARD_YARDFORCE500_VARIANT_ORIG
  __HAL_RCC_AFIO_CLK_ENABLE();
  __HAL_RCC_PWR_CLK_ENABLE();
#endif

  MX_DMA_Init();

#if BOARD_HAS_MASTER_USART
  // Init debug USART
  MASTER_USART_Init();
#endif

  DB_TRACE("\r\n");
  DB_TRACE("    __  ___                    ___\r\n");
  DB_TRACE("   /  |/  /___ _      ______ _/ (_)\r\n");
  DB_TRACE("  / /|_/ / __ \\ | /| / / __ `/ / / \r\n");
  DB_TRACE(" / /  / / /_/ / |/ |/ / /_/ / / /  \r\n");
  DB_TRACE("/_/  /_/\\____/|__/|__/\\__, /_/_/   \r\n");
  DB_TRACE("                     /____/        \r\n");
  DB_TRACE("\r\n\r\n");
  DB_TRACE(" * Master USART (debug) initialized\r\n");
  LED_Init();
  DB_TRACE(" * LED initialized\r\n");
  TIM2_Init();
  ADC_Charging_Init();
#ifdef OPTION_PERIMETER
  Perimeter_vInit();
#endif
  DB_TRACE(" * Charging ADC initialized\r\n");
  TIM3_Init();
  HAL_TIM_PWM_Start(&TIM3_Handle, TIM_CHANNEL_4);
  TIM4_Init();
  HAL_TIM_PWM_Start(&TIM4_Handle, TIM_CHANNEL_3);
  DB_TRACE(" * Timer3 (Beeper) initialized\r\n");
  TF4_Init();
  DB_TRACE(" * 24V switched on\r\n");
  RAIN_Sensor_Init();
  DB_TRACE(" * RAIN Sensor enabled\r\n");
  HALLSTOP_Sensor_Init();
  DB_TRACE(" * HALL Sensor enabled\r\n");

  I2C_Init();
  DB_TRACE(" * Hard I2C initialized\r\n");
  if (I2C_Acclerometer_TestDevice())
  {
    I2C_Accelerometer_Setup();
  }
  else
  {
    chirp(3);
    DB_TRACE("\e[01;31m * WARNING: initalization of onboard accelerometer for tilt protection failed !\e[0m\r\n");
  }

  DB_TRACE(" * Accelerometer (onboard/tilt safety) initialized\r\n");
  SW_I2C_Init();
  DB_TRACE(" * Soft I2C (J18) initialized\r\n");
  DB_TRACE(" * Testing supported IMUs:\r\n");
  IMU_Init();
  // IMU calibration is handled on the ROS2 side (hardware_bridge_node)
  // when the robot is on the dock.
  PANEL_Init();
  DB_TRACE(" * Panel initialized\r\n");
  Emergency_Init();
  DB_TRACE(" * Emergency sensors initialized\r\n");
  TIM1_Init();
  DB_TRACE(" * Timer1 (Charge PWM) initialized\r\n");
  MX_USB_DEVICE_Init();
  DB_TRACE(" * USB CDC initialized\r\n");
// Init Drive Motors and Blade Motor
#ifdef DRIVEMOTORS_USART_ENABLED
  DRIVEMOTOR_Init();
  DB_TRACE(" * Drive Motors USART initialized\r\n");
#endif
#ifdef BLADEMOTOR_USART_ENABLED
  BLADEMOTOR_Init();
#endif
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
  ULTRASONICSENSOR_Init();
#endif

  hal_gpio_write(BOARD_STATUS_LED, false);
  hal_gpio_write(BOARD_TF4_SWITCH, true);

  // Initialize Main Timers
  NBT_init(&main_chargecontroller_nbt, 10);
  NBT_init(&main_statusled_nbt, 1000);
  NBT_init(&main_emergency_nbt, 10);
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
  NBT_init(&main_ultrasonicsensor_nbt, 50);
#endif
  NBT_init(&main_blademotor_nbt, 100);
  NBT_init(&main_drivemotor_nbt, 20);
  NBT_init(&main_wdg_nbt, 10);
  NBT_init(&main_buzzer_nbt, 200);

  DB_TRACE(" * NBT Main timers initialized\r\n");

#ifdef I_DONT_NEED_MY_FINGERS
  DB_TRACE("\r\n\e[01;31m");
  DB_TRACE("=========================================================\r\n");
  DB_TRACE("   EMERGENCY/SAFETY FEATURES ARE DISABLED IN board.h ! \r\n");
  DB_TRACE("=========================================================\r\n");
  DB_TRACE("\e[0m\r\n");
#endif
  // Initialize ROS
  init_ROS();
  DB_TRACE(" * ROS serial node initialized\r\n");
  DB_TRACE("\r\n\e[01;36m >>> entering main loop ...\e[0m\r\n\r\n");
  // <chirp><chirp> means we are in the main loop
  chirp(2);

  WATCHDOG_vInit();

  while (1)
  {
    chatter_handler();
    motors_handler();
    panel_handler();
    spinOnce();
    broadcast_handler();

    DRIVEMOTOR_App_Rx();
#ifdef OPTION_PERIMETER
    Perimeter_vApp();
#endif

    if (NBT_handler(&main_chargecontroller_nbt))
    {
      ADC_input();
      ChargeController();
    }
    if (NBT_handler(&main_statusled_nbt))
    {
      StatusLEDUpdate();

