Pepeuch/mowglinext/firmware/stm32/ros_usbnode/src/main.c
/*
 * Feed the watchdog every 10ms
 */
static void WATCHDOG_Refresh(void)
{
  /* Update WWDG counter */
  WwdgHandle.Instance = WWDG;
  if (HAL_WWDG_Refresh(&WwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" WWDG refresh error\r\n");
#endif /* DB_ACTIVE */
  }

  /* Reload IWDG counter */
  IwdgHandle.Instance = IWDG;
  if (HAL_IWDG_Refresh(&IwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" IWDG refresh error\r\n");
#endif /* DB_ACTIVE */
  }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  // do nothing here
}

/*
 * called when DMA transfer completes
 * update <xxxx>_tx_busy to let XXXX_Transmit function now when the DMA buffer is free
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
#if BOARD_HAS_MASTER_USART
  if (huart->Instance == MASTER_USART_INSTANCE)
  {
    if (__HAL_USART_GET_FLAG(&MASTER_USART_Handler, USART_FLAG_TC))
    {
      master_tx_busy = 0;
    }
  }
#endif
}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart)
{
  // do nothing here
}

/*
 * Master UART receive ISR
 * DriveMotors UART receive ISR
 * PANEL UART receive ISR
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
#if BOARD_HAS_MASTER_USART
  if (huart->Instance == MASTER_USART_INSTANCE)
  {
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
    ULTRASONICSENSOR_ReceiveIT();
#endif
  }
  else
#endif
      if (huart->Instance == BLADEMOTOR_USART_INSTANCE)
  {
    BLADEMOTOR_ReceiveIT();
  }
  else if (huart->Instance == DRIVEMOTORS_USART_INSTANCE)
  {
    DRIVEMOTOR_ReceiveIT();
  }
}
